Enums/ИсточникиДанныхДляРасчетаСреднегоЗаработка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ИсточникиДанныхДляРасчетаСреднегоЗаработка</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПереносДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияДоНачалаЭксплуатации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исправления</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИсточникиДанныхДляРасчетаСреднегоЗаработка/Ext/ManagerModule.bsl
Функция РезультатыРедактирования() Экспорт
	
	Источники = Новый Массив;
	Источники.Добавить(Перечисления.ИсточникиДанныхДляРасчетаСреднегоЗаработка.СведенияДоНачалаЭксплуатации);
	Источники.Добавить(Перечисления.ИсточникиДанныхДляРасчетаСреднегоЗаработка.Исправления);
	
	Возврат Источники;
	
КонецФункции

Функция ПриоритетИсточников() Экспорт
	
	Соответствие = Новый Соответствие;
	
	Соответствие.Вставить(Перечисления.ИсточникиДанныхДляРасчетаСреднегоЗаработка.ПустаяСсылка(), 0);
	
	Приоритет = 1;
	Для Каждого МетаданныеЗначения Из Метаданные.Перечисления.ИсточникиДанныхДляРасчетаСреднегоЗаработка.ЗначенияПеречисления Цикл
		Соответствие.Вставить(Перечисления.ИсточникиДанныхДляРасчетаСреднегоЗаработка[МетаданныеЗначения.Имя], Приоритет);
		Приоритет = Приоритет + 1;
	КонецЦикла;
	Возврат Соответствие;
	
КонецФункции
